pipe_heattransfer/system/air/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (-6 -6 -1)             
    (6 -6 -1)            
    (6 6 -1)           
    (-6 6 -1)            
    (-6 -6 401)             
    (6 -6 401)            
    (6 6 401)           
    (-6 6 401)       
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
	    (0 3 2 1)
	    (4 5 6 7)
	    (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
