pipe_heattransfer/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

# Create meshes
runApplication -s air  blockMesh -region air
runApplication -s pipe blockMesh -region pipe

# Create rotor blades in air region
#runApplication -s air.1 \
#    topoSet -region air -dict system/topoSetDict.1

#runApplication createBaffles -region air -overwrite

# Create rotor zone in air region for MRF
#runApplication -s air.2 \
#    topoSet -region air -dict system/topoSetDict.2

#rm -rf constant/air/polyMesh/sets

# Set initial fields
#restore0Dir

#------------------------------------------------------------------------------
